import { ITranslation } from './types';

export const el: ITranslation = {
  common: {
    welcome: 'Καλώς ήρθατε',
    error: 'Προέκυψε ένα σφάλμα',
    loading: 'Φόρτωση...',
    noUserFound:
      'Δεν έχετε εξουσιοδότηση να κάνετε αυτό το αίτημα. Παρακαλώ συνδεθείτε',
    userIdMissing:
      'Φαίνεται ότι λείπει το αναγνωριστικό χρήστη. Παρακαλώ δώστε το για να συνεχίσετε',
    scanLimitReached:
      'Φτάσατε τον μέγιστο αριθμό σαρώσεων που επιτρέπονται. Παρακαλώ αναβαθμίστε το πλάνο σας για να συνεχίσετε να χρησιμοποιείτε την υπηρεσία',
    mandatoryLanguage: 'Ο κωδικός γλώσσας απαιτείται',
  },
  auth: {
    signIn: 'Σύνδεση',
    signUp: 'Εγγραφή',
  },

  loginUserViaEmail: {
    mandatoryEmail: 'Παρακαλώ δώστε τη διεύθυνση email σας για να συνεχίσετε',
    invalidEmail:
      'Η διεύθυνση email που εισάγατε είναι άκυρη. Παρακαλώ ελέγξτε την και δοκιμάστε ξανά',
    accountCreated:
      'Ο λογαριασμός σας δημιουργήθηκε με επιτυχία! Παρακαλώ ελέγξτε το email σας για τον κωδικό επαλήθευσης',
    verificationCodeSent:
      'Σας στείλαμε έναν κωδικό επαλήθευσης στο email σας. Παρακαλώ ελέγξτε τα εισερχόμενά σας',
    internalError:
      'Προέκυψε σφάλμα κατά την επεξεργασία της πιστοποίησής σας μέσω email. Παρακαλώ δοκιμάστε ξανά',
  },

  sendEmailVerification: {
    emailMandatory: 'Απαιτείται διεύθυνση email για να συνεχίσετε',
    emailUsed:
      'Αυτή η διεύθυνση email χρησιμοποιείται ήδη. Παρακαλώ χρησιμοποιήστε μια διαφορετική',
    userNotFound:
      'Δεν μπορέσαμε να βρούμε τον συγκεκριμένο χρήστη. Παρακαλώ ελέγξτε τα στοιχεία σας και δοκιμάστε ξανά',
    verificationCodeSent:
      'Ο κωδικός επαλήθευσης στάλθηκε με επιτυχία στο email σας',
    generalError: 'Προέκυψε σφάλμα κατά την έναρξη της επαλήθευσης email',
  },

  getInterpretationByDate: {
    startEndDateRequired: 'Απαιτούνται ημερομηνία έναρξης και λήξης.',
    startDatePriority:
      'Η ημερομηνία έναρξης δεν μπορεί να είναι μετά από την ημερομηνία λήξης.',
    generalError: 'Αδυναμία ανάκτησης αναλύσεων.',
  },

  verifyAuthenticationCode: {
    authCodeMandatory: 'Απαιτείται κωδικός πιστοποίησης για να συνεχίσετε',
    emailAddressMandatory:
      'Η διεύθυνση email είναι υποχρεωτική για να συνεχίσετε',
    userNotFound:
      'Ο συγκεκριμένος χρήστης δεν βρέθηκε. Παρακαλώ ελέγξτε τα στοιχεία σας και δοκιμάστε ξανά',
    invalidAuthCode:
      'Ουπς! Αυτός δεν είναι έγκυρος κωδικός πιστοποίησης. Παρακαλώ ελέγξτε και δοκιμάστε ξανά!',
    authCodeExpired:
      "Ουπς! Ο κωδικός σας έχει λήξει. Παρακαλώ ξαναπροσπαθήστε σύνδεση με τη διεύθυνση email σας ή κάντε κλικ στο 'Επανάληψη αποστολής κωδικού'",
    authCodeVerified: 'Ο χρήστης επαληθεύτηκε με επιτυχία',
    generalError:
      'Ουπς! Συναντήσαμε σφάλμα κατά την επαλήθευση του κωδικού σας',
  },

  analyzeImage: {
    scanLimitReached:
      'Φτάσατε τον μέγιστο αριθμό σαρώσεων που επιτρέπονται. Παρακαλώ αναβαθμίστε το πλάνο σας για να συνεχίσετε να χρησιμοποιείτε την υπηρεσία',
    imageMissing:
      'Εικόνα λείπει. Παρακαλώ επιλέξτε και ανεβάστε μια εικόνα για να συνεχίσετε',
    uploadImageStorageError:
      'Συναντήσαμε σφάλμα κατά το ανέβασμα της εικόνας σας. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    interpretationNotSaved:
      'Αδυναμία αποθήκευσης του αποτελέσματος ανάλυσης. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    analysisCompleted: 'Η ανάλυση εικόνας ολοκληρώθηκε με επιτυχία!',
  },
  analyzeVideo: {
    noVideoFound:
      'Αρχείο βίντεο λείπει. Παρακαλώ επιλέξτε και ανεβάστε ένα βίντεο για να συνεχίσετε',
    uploadVideoStorageError:
      'Συναντήσαμε σφάλμα κατά το ανέβασμα του βίντεο σας. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    interpretationNotSaved:
      'Αδυναμία αποθήκευσης του αποτελέσματος ανάλυσης. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά',
    analysisCompleted: 'Η ανάλυση βίντεο ολοκληρώθηκε με επιτυχία!',
  },

  incrementUsersScans: {
    incrementSuccessScan: 'Μια ακόμη σάρωση έχει χρησιμοποιηθεί',
    generalError: 'Αδυναμία μείωσης του αριθμού σαρώσεων!',
  },
  decrementUserScans: {
    decrementSuccessScan: 'Μια σάρωση έχει μειωθεί',
    decrementErrorScan:
      'Προέκυψε πρόβλημα κατά την ενημέρωση του αριθμού σαρώσεων. Παρακαλώ δοκιμάστε ξανά αργότερα',
    generalError: 'Αδυναμία μείωσης του αριθμού σαρώσεων!',
  },
  updateUserSubscription: {
    subscribeSuccess: 'Επιτυχής εγγραφή!',
    updateSubscriptionError: 'Αδυναμία ενημέρωσης της συνδρομής χρήστη!',
  },
  updateUserLanguage: {
    updateSuccess: 'Επιτυχής ενημέρωση γλώσσας!',
    updateError:
      'Προέκυψε απρόσμενο σφάλμα κατά την ενημέρωση της γλώσσας. Παρακαλώ δοκιμάστε ξανά αργότερα',
  },

  getUserInfo: {
    successGetInfo: 'Επιτυχής λήψη δεδομένων πληροφοριών χρήστη',
    errorGetInfo:
      'Προέκυψε απρόσμενο σφάλμα κατά την ανάκτηση πληροφοριών χρήστη. Παρακαλώ δοκιμάστε ξανά αργότερα',
  },
  getUserInfoById: {
    noUserInfoData:
      'Το έγγραφο χρήστη υπάρχει, αλλά δεν υπάρχουν διαθέσιμα δεδομένα',
    getUserFetchError:
      'Προέκυψε σφάλμα κατά την ανάκτηση των πληροφοριών χρήστη',
  },

  updateScanInterpretation: {
    success: 'Η εγγραφή ερμηνείας σάρωσης ενημερώθηκε με επιτυχία!',
    generalError: 'Προέκυψε σφάλμα κατά την ενημέρωση της ερμηνείας σάρωσης',
    paramsRequired: "Απαιτούνται και το 'documentId' και τα 'fieldsToUpdate'",
  },
  deleteScanInterpretation: {
    success: 'Η αναφορά διαγράφηκε με επιτυχία!',
    documentIdRequired: "Απαιτείται το 'DocumentId' για να συνεχίσετε.",
    generalError:
      'Κάτι πήγε στραβά κατά τη διαγραφή της αναφοράς. Παρακαλώ δοκιμάστε ξανά.',
  },

  getInterpretationByDocumentId: {
    paramsRequired: "Απαιτείται το 'DocumentId'",
    noDocIdFound: 'Δεν βρέθηκε έγγραφο με το παρεχόμενο αναγνωριστικό',
    success: 'Το έγγραφο ανακτήθηκε με επιτυχία',
    generalError:
      'Προέκυψε σφάλμα κατά την ανάκτηση της ερμηνείας για το παρεχόμενο αναγνωριστικό εγγράφου',
  },

  getRecentInterpretation: {
    limitRequired: 'Το όριο πρέπει να είναι αριθμός μεταξύ 1 και 100',
    noInterpretationFound: 'Δεν βρέθηκαν ερμηνείες',
    success: 'Οι πρόσφατες ερμηνείες ανακτήθηκε με επιτυχία!',
    generalError: 'Προέκυψε σφάλμα κατά την ανάκτηση πρόσφατων ερμηνειών',
    generalErrorAdditional: 'Προέκυψε εσωτερικό σφάλμα διακομιστή',
  },

  storeDeviceToken: {
    deviceTokenRequired:
      'Η παροχή ενός αναγνωριστικού συσκευής είναι υποχρεωτική.',
    generalError: 'Σφάλμα αποθήκευσης αναγνωριστικού συσκευής',
  },

  sendGlobalPushNotifications: {
    requiredParams: 'Ο τίτλος και το κείμενο ειδοποίησης είναι υποχρεωτικά.',
    generalError: 'Προέκυψε σφάλμα κατά την επεξεργασία ειδοποιήσεων',
    generalErrorAdditional: 'Αποτυχία αποστολής καθολικής ειδοποίησης',
  },

  checkDeviceUniqueIdentifier: {
    deviceMandatory: 'Το αναγνωριστικό συσκευής είναι υποχρεωτικό',
    languageMandatory: 'Η γλώσσα είναι υποχρεωτική',
    deviceIdentified: 'Η συσκευή σας έχει αναγνωριστεί με επιτυχία',
    generalError:
      'Προέκυψε σφάλμα κατά τον έλεγχο δοκιμαστικής περιόδου συσκευής',
  },

  getUserNotification: {
    generalError: 'Αποτυχία ανάκτησης ειδοποιήσεων χρήστη',
    generalErrorAdditional:
      'Προέκυψε σφάλμα κατά την ανάκτηση ειδοποιήσεων χρήστη',
  },

  getScanCategories: {
    noCategoryFound: 'Δεν βρέθηκαν κατηγορίες',
    generalError: 'Προέκυψε σφάλμα κατά την ανάκτηση κατηγοριών σαρώσεων',
  },

  uploadScanCategories: {
    successfullyUploaded: 'Οι κατηγορίες σαρώσεων ανέβηκαν με επιτυχία',
    generalError: 'Αποτυχία ανεβάσματος κατηγοριών σαρώσεων',
  },

  sendUserNotification: {
    noTokenFound:
      'Δεν βρέθηκαν έγκυρα διακριτικά Expo. Αδυναμία αποστολής ειδοποιήσεων',
    generalError: 'Αποτυχία αποστολής ειδοποίησης',
  },

  updateUser: {
    successUpdatedUser: 'Ο χρήστης ενημερώθηκε με επιτυχία',
    updateUserError:
      'Αδυναμία ενημέρωσης της εγγραφής χρήστη. Παρακαλώ δοκιμάστε ξανά.',
  },

  loginUserAnonymously: {
    mandatoryUsername: 'Επιλέξτε ένα ψευδώνυμο και ας ξεκινήσουμε!',
    userLoggedIn: 'Καλώς ήρθατε! Βρίσκεστε μέσα.',
    accountCreated: 'Βρίσκεστε μέσα! Απολαύστε την εξερεύνηση!',
    error:
      'Ουπς! Κάτι πήγε στραβά. Παρακαλώ ελέγξτε τη σύνδεσή σας και δοκιμάστε ξανά.',
  },
  continueConversation: {
    messagesLimit:
      'Η Aura είναι σε πλήρη χωρητικότητα! Ανεβάστε άλλη σάρωση για να συνεχίσετε να λαμβάνετε αναλύσεις και πληροφορίες',
    conversationNotFound: 'Αδυναμία εύρεσης της συνομιλίας',
    serviceIssueAi:
      'Φαίνεται να υπάρχει πρόβλημα με την υπηρεσία AI. Παρακαλώ δοκιμάστε ξανά.',
    noResponseAiService:
      'Αποτυχία λήψης έγκυρης απάντησης από την υπηρεσία AI. Παρακαλώ δοκιμάστε ξανά',
  },
};
